home buh/src/Documents/Траты/Траты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Траты</name>
  <registerRecords>AccumulationRegister.ДенежныеСредстваНаСчетах</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеДСПоСтатьям</registerRecords>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>EnumRef.ФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьиДвиженияДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

home buh/src/AccumulationRegisters/ДенежныеСредстваНаСчетах/ДенежныеСредстваНаСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваНаСчетах</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

home buh/src/AccumulationRegisters/ДвижениеДСПоСтатьям/ДвижениеДСПоСтатьям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвижениеДСПоСтатьям</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>EnumRef.ФизЛицо</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

home buh/src/Documents/Траты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДенежныеСредстваНаСчетах Расход
	Движения.ДенежныеСредстваНаСчетах.Записывать = Истина;
	Движение = Движения.ДенежныеСредстваНаСчетах.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Счет = Счет;
	Движение.Сумма = Сумма;

	// регистр ДвижениеДСПоСтатьям 
	Движения.ДвижениеДСПоСтатьям.Записывать = Истина;
	Движение = Движения.ДвижениеДСПоСтатьям.Добавить();
	Движение.Период = Дата;
	Движение.ФизЛицо = ФизЛицо;
	Движение.Статья = СтатьиДвиженияДС;
	Движение.Сумма = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
